nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe247/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSPIPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSPIPins(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortE);
    /* Configure digital filter */
    PORT_EnablePinsDigitalFilter(
        /* Digital filter is configured on port B */
        PORTB,
        /* Digital filter is configured for PORTB0 */
        PORT_DFER_DFE_3_MASK,
        /* Disable digital filter */
        false);

    const port_pin_config_t LPSPI0_SIN = {/* Internal pull-up/down resistor is disabled */
                                          kPORT_PullDisable,
                                          /* Passive filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Low drive strength is configured */
                                          kPORT_LowDriveStrength,
                                          /* Pin is configured as LPSPI0_SIN */
                                          kPORT_MuxAlt3,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          kPORT_UnlockRegister};
    /* PORTB3 (pin 63) is configured as LPSPI0_SIN */
    PORT_SetPinConfig(BOARD_INITSPIPINS_LPSPI0_SIN_PORT, BOARD_INITSPIPINS_LPSPI0_SIN_PIN, &LPSPI0_SIN);
    /* Configure digital filter */
    PORT_EnablePinsDigitalFilter(
        /* Digital filter is configured on port E */
        PORTE,
        /* Digital filter is configured for PORTE0 */
          PORT_DFER_DFE_0_MASK
            /* Digital filter is configured for PORTE1 */
            | PORT_DFER_DFE_2_MASK
            /* Digital filter is configured for PORTE2 */
            | PORT_DFER_DFE_6_MASK,
        /* Disable digital filter */
        false);

    const port_pin_config_t LPSPI0_SCK = {/* Internal pull-up/down resistor is disabled */
                                          kPORT_PullDisable,
                                          /* Passive filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Low drive strength is configured */
                                          kPORT_LowDriveStrength,
                                          /* Pin is configured as LPSPI0_SCK */
                                          kPORT_MuxAlt2,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          kPORT_UnlockRegister};
    /* PORTE0 (pin 138) is configured as LPSPI0_SCK */
    PORT_SetPinConfig(BOARD_INITSPIPINS_LPSPI0_SCK_PORT, BOARD_INITSPIPINS_LPSPI0_SCK_PIN, &LPSPI0_SCK);

    const port_pin_config_t LPSPI0_SOUT = {/* Internal pull-up/down resistor is disabled */
                                           kPORT_PullDisable,
                                           /* Passive filter is disabled */
                                           kPORT_PassiveFilterDisable,
                                           /* Low drive strength is configured */
                                           kPORT_LowDriveStrength,
                                           /* Pin is configured as LPSPI0_SOUT */
                                           kPORT_MuxAlt2,
                                           /* Pin Control Register fields [15:0] are not locked */
                                           kPORT_UnlockRegister};
    /* PORTE2 (pin 122) is configured as LPSPI0_SOUT */
    PORT_SetPinConfig(BOARD_INITSPIPINS_LPSPI0_SOUT_PORT, BOARD_INITSPIPINS_LPSPI0_SOUT_PIN, &LPSPI0_SOUT);

    const port_pin_config_t LPSPI0_PCS2 = {/* Internal pull-up/down resistor is disabled */
                                           kPORT_PullDisable,
                                           /* Passive filter is disabled */
                                           kPORT_PassiveFilterDisable,
                                           /* Low drive strength is configured */
                                           kPORT_LowDriveStrength,
                                           /* Pin is configured as LPSPI0_PCS2 */
                                           kPORT_MuxAlt2,
                                           /* Pin Control Register fields [15:0] are not locked */
                                           kPORT_UnlockRegister};
    /* PORTE6 (pin 121) is configured as LPSPI0_PCS2 */
    PORT_SetPinConfig(BOARD_INITSPIPINS_LPSPI0_PCS2_PORT, BOARD_INITSPIPINS_LPSPI0_PCS2_PIN, &LPSPI0_PCS2);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
